# CorrectionFactorSetIterator Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactorSetIterator Constructor
CorrectionFactorSetIterator Class See Also
---
For Internal Use Only.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CorrectionFactorSetIterator()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CorrectionFactorSetIterator()
```

# Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
# See Also
CorrectionFactorSetIterator Class
Autodesk.Revit.DB.Electrical Namespace